v001-timeDependent/0/water/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
333.15
333.15
333.15
333.15
333.15
333.15
333.15
333.15
...
)
;

boundaryField
{
    water_inlet
    {
        type            fixedValue;
        value           uniform 333.15;
    }
    water_outlet
    {
        type            zeroGradient;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        refValue        nonuniform List<scalar> 
400
(
317.74954
320.43468
321.96974
322.95363
323.64526
324.1662
324.57871
324.91751
...
)
;
        refGradient     uniform 0;
        valueFraction   nonuniform List<scalar> 
400
(
0.032673807
0.028204568
0.025684431
0.024212431
0.023360125
0.022897446
0.022689133
0.022650166
...
)
;
        source          uniform 0;
        value           nonuniform List<scalar> 
400
(
332.63961
332.77841
332.84503
332.88106
332.90211
332.91497
332.92303
332.92809
...
)
;
        logInterval     -1;
        writePrecision  8;
        updateHeader    1;
        writeToFile     0;
        useUserTime     1;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
