v001-timeDependent/0/water/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "30000/water";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
6000
(
(0.25028648 -3.4193492e-05 8.3924878e-21)
(0.25028875 -7.4648811e-05 -6.326869e-18)
(0.25029344 -0.00011804414 -1.0176386e-18)
(0.25030059 -0.00016540046 2.3272772e-19)
(0.25031046 -0.00021487336 -2.3781321e-19)
(0.25032332 -0.00026685039 3.542633e-19)
(0.25033948 -0.00032192175 1.8195908e-19)
(0.25035939 -0.00038078672 8.9315967e-20)
...
)
;

boundaryField
{
    water_inlet
    {
        type            fixedValue;
        value           uniform (0.25 0 0);
    }
    water_outlet
    {
        type            zeroGradient;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            noSlip;
    }
}


// ************************************************************************* //
