v001-timeDependent/0/water/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
0.041292847
0.041292824
0.041292831
0.041292856
0.041292889
0.041292932
0.041292983
0.041293016
...
)
;

boundaryField
{
    water_inlet
    {
        type            calculated;
        value           uniform 0.041850807;
    }
    water_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
0.13348455
0.13236716
0.13011782
0.12709797
0.12354945
0.11954547
0.11497786
0.10959475
0.10305179
0.094952922
0.084875822
0.072394218
0.05713434
0.038977608
0.016815666
)
;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            compressible::alphatWallFunction;
        value           nonuniform List<scalar> 
400
(
0.0015669952
0.0018471873
0.0020481781
0.0021849324
0.0022719934
0.0023219691
0.0023451352
0.002349516
...
)
;
    }
}


// ************************************************************************* //
