v001-timeDependent/0/water/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
0.00010005327
0.00010005311
0.00010005314
0.00010005327
0.00010005342
0.00010005363
0.0001000539
0.00010005427
...
)
;

boundaryField
{
    water_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 0.00011791765;
    }
    water_outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           nonuniform List<scalar> 
15
(
2.3464834e-05
2.4529637e-05
2.6937543e-05
3.078721e-05
3.6314938e-05
4.3872069e-05
5.3977024e-05
6.7434762e-05
8.5581892e-05
0.00011080952
0.00014779793
0.00020689246
0.00031539711
0.00056830073
0.0014409682
)
;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            epsilonWallFunction;
        blending        stepwise;
        value           nonuniform List<scalar> 
400
(
0.00073980483
0.0010520452
0.0013270628
0.0015411415
0.0016895689
0.0017792142
0.0018218943
0.0018300463
...
)
;
    }
}


// ************************************************************************* //
