v001-timeDependent/0/water/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
4.1367308e-05
4.1367285e-05
4.1367292e-05
4.1367317e-05
4.136735e-05
4.1367394e-05
4.1367445e-05
4.1367477e-05
...
)
;

boundaryField
{
    water_inlet
    {
        type            calculated;
        value           uniform 4.1926275e-05;
    }
    water_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
0.00013372526
0.00013260585
0.00013035245
0.00012732716
0.00012377224
0.00011976104
0.0001151852
0.00010979237
0.00010323762
9.5124145e-05
8.5028874e-05
7.2524763e-05
5.7237367e-05
3.9047894e-05
1.6845989e-05
)
;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           nonuniform List<scalar> 
400
(
1.3343477e-06
1.5729405e-06
1.7440907e-06
1.8605416e-06
1.9346768e-06
1.9772327e-06
1.9969594e-06
2.0006898e-06
...
)
;
    }
}


// ************************************************************************* //
