v001-timeDependent/0/water/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
100064.08
100064.08
100064.08
100064.09
100064.09
100064.1
100064.11
100064.12
...
)
;

boundaryField
{
    water_inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
100064.08
100064.08
100064.08
100064.09
100064.09
100064.1
100064.11
100064.12
100064.14
100064.15
100064.17
100064.19
100064.21
100064.24
100064.36
)
;
    }
    water_outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
100064.36
100063.96
100063.71
100063.49
100063.26
100063.03
100062.79
100062.56
...
)
;
    }
}


// ************************************************************************* //
