v001-timeDependent/system/rock/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(h|e|hFinal|eFinal)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08; 
        relTol           0;    
    }
}

PIMPLE
{
    nOuterCorrectors 1;   
    nCorrectors      1;
    nNonOrthogonalCorrectors 0; 
}


// ************************************************************************* //